tutorials/precice/onedirectional/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
	volumetricFlowRate	0.007142857;
	value		uniform (0 0 0);
    }
    outlet
    {
        type                coupledVelocity;
        refValue           uniform (0 0 0);
        //value                uniform (0 0 0);
        //type            fixedGradient;
        //gradient           uniform (0 0 0);
        //type            coupledVelocity;
        //refValue        uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
    atmosphere
    {
        type              noSlip;
        //type            inletOutlet;
        //inletValue      uniform (0 0 0);
        //value           uniform (0 0 0);
        //type            zeroGradient;
        //type            pressureInletOutletVelocity;
        //value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
